import random


# 1. A 和 B 在 C 的 D 里 E 地 F（完整）
# 2. A 在 C 里 F（最简）
# 3. A 和 B 在 C 里 F (1/3)
# 4. A 在 C 的 D 里 F (1/3)
# 5. A 在 C 里 E 地 F (1/3)
# 6. A 和 B 在 C 的 D 里 F (2/3)
# 7. A 和 B 在 C 里 E 地 F (2/3)
# 8. A 在 C 的 D 里 E 地 F (2/3)


# A: 名字（随机） random_name()
# B: 名字或者关系人物（可选，随机） random_name_second()
# C: 地点（随机） random_site()
# D: 地点下属区域（可选，随机） random_site_area()
# E: 副词，修饰F（可选，随机） random_adv()
# F: 动作（随机） random_action()

def random_name():
    last_name = [
        '赵', '钱', '孙', '李', '周', '吴', '郑', '王', '冯', '陈', '褚', '卫', '蒋', '沈', '韩', '杨', '朱', '秦', '尤', '许',
        '何', '吕', '施', '张', '孔', '曹', '严', '华', '金', '魏', '陶', '姜', '戚', '谢', '邹', '喻', '柏', '水', '窦', '章',
        '云', '苏', '潘', '葛', '奚', '范', '彭', '郎', '鲁', '韦', '昌', '马', '苗', '凤', '花', '方', '俞', '任', '袁', '柳',
        '酆', '鲍', '史', '唐', '费', '廉', '岑', '薛', '雷', '贺', '倪', '汤', '滕', '殷', '罗', '毕', '郝', '邬', '安', '常',
        '乐', '于', '时', '傅', '皮', '卞', '齐', '康', '伍', '余', '元', '卜', '顾', '孟', '平', '黄', '和', '穆', '萧', '尹',
        '姚', '邵', '堪', '汪', '祁', '毛', '禹', '狄', '米', '贝', '明', '臧', '计', '伏', '成', '戴', '谈', '宋', '茅', '庞',
        '熊', '纪', '舒', '屈', '项', '祝', '董', '梁']
    first_name = [
        '的', '一', '是', '了', '我', '不', '人', '在', '他', '有', '这', '个', '上', '们', '来', '到', '时', '大', '地', '为',
        '子', '中', '你', '说', '生', '国', '年', '着', '就', '那', '和', '要', '她', '出', '也', '得', '里', '后', '自', '以',
        '会', '家', '可', '下', '而', '过', '天', '去', '能', '对', '小', '多', '然', '于', '心', '学', '么', '之', '都', '好',
        '看', '起', '发', '当', '没', '成', '只', '如', '事', '把', '还', '用', '第', '样', '道', '想', '作', '种', '开', '美',
        '总', '从', '无', '情', '己', '面', '最', '女', '但', '现', '前', '些', '所', '同', '日', '手', '又', '行', '意', '动',
        '方', '期', '它', '头', '经', '长', '儿', '回', '位', '分', '爱', '老', '因', '很', '给', '名', '法', '间', '斯', '知',
        '世', '什', '两', '次', '使', '身', '者', '被', '高', '已', '亲', '其', '进', '此', '话', '常', '与', '活', '正', '感',
        '见', '明', '问', '力', '理', '尔', '点', '文', '几', '定', '本', '公', '特', '做', '外', '孩', '相', '西', '果', '走',
        '将', '月', '十', '实', '向', '声', '车', '全', '信', '重', '三', '机', '工', '物', '气', '每', '并', '别', '真', '打',
        '太', '新', '比', '才', '便', '夫', '再', '书', '部', '水', '像', '眼', '等', '体', '却', '加', '电', '主', '界', '门',
        '利', '海', '受', '听', '表', '德', '少', '克', '代', '员', '许', '稜', '先', '口', '由', '死', '安', '写', '性', '马',
        '光', '白', '或', '住', '难', '望', '教', '命', '花', '结', '乐', '色', '更', '拉', '东', '神', '记', '处', '让', '母',
        '父', '应', '直', '字', '场', '平', '报', '友', '关', '放', '至', '张', '认', '接', '告', '入', '笑', '内', '英', '军',
        '候', '民', '岁', '往', '何', '度', '山', '觉', '路', '带', '万', '男', '边', '风', '解', '叫', '任', '金', '快', '原',
        '吃', '妈', '变', '通', '师', '立', '象', '数', '四', '失', '满', '战', '远', '格', '士', '音', '轻', '目', '条', '呢',
        '病', '始', '达', '深', '完', '今', '提', '求', '清', '王', '化', '空', '业', '思', '切', '怎', '非', '找', '片', '罗',
        '钱', '紶', '吗', '语', '元', '喜', '曾', '离', '飞', '科', '言', '干', '流', '欢', '约', '各', '即', '指', '合', '反',
        '题', '必', '该', '论', '交', '终', '林', '请', '医', '晚', '制', '球', '决', '窢', '传', '画', '保', '读', '运', '及',
        '则', '房', '早', '院', '量', '苦', '火', '布', '品', '近', '坐', '产', '答', '星', '精', '视', '五', '连', '司', '巴',
        '奇', '管', '类', '未', '朋', '且', '婚', '台', '夜', '青', '北', '队', '久', '乎', '越', '观', '落', '尽', '形', '影',
        '红', '爸', '百', '令', '周', '吧', '识', '步', '希', '亚', '术', '留', '市', '半', '热', '送', '兴', '造', '谈', '容',
        '极', '随', '演', '收', '首', '根', '讲', '整', '式', '取', '照', '办', '强', '石', '古', '华', '諣', '拿', '计', '您',
        '装', '似', '足', '双', '妻', '尼', '转', '诉', '米', '称', '丽', '客', '南', '领', '节', '衣', '站', '黑', '刻', '统',
        '断', '福', '城', '故', '历', '惊', '脸', '选', '包', '紧', '争', '另', '建', '维', '绝', '树', '系', '伤', '示', '愿',
        '持', '千', '史', '谁', '准', '联', '妇', '纪', '基', '买', '志', '静', '阿', '诗', '独', '复', '痛', '消', '社', '算',
        '义', '竟', '确', '酒', '需', '单', '治', '卡', '幸', '兰', '念', '举', '仅', '钟', '怕', '共', '毛', '句', '息', '功',
        '官', '待', '究', '跟', '穿', '室', '易', '游', '程', '号', '居', '考', '突', '皮', '哪', '费', '倒', '价', '图', '具',
        '刚', '脑', '永', '歌', '响', '商', '礼', '细', '专', '黄', '块', '脚', '味', '灵', '改', '据', '般', '破', '引', '食',
        '仍', '存', '众', '注', '笔', '甚', '某', '沉', '血', '备', '习', '校', '默', '务', '土', '微', '娘', '须', '试', '怀',
        '料', '调', '广', '蜖', '苏', '显', '赛', '查', '密', '议', '底', '列', '富', '梦', '错', '座', '参', '八', '除', '跑',
        '亮', '假', '印', '设', '线', '温', '虽', '掉', '京', '初', '养', '香', '停', '际', '致', '阳', '纸', '李', '纳', '验',
        '助', '激', '够', '严', '证', '帝', '饭', '忘', '趣', '支', '春', '集', '丈', '木', '研', '班', '普', '导', '顿', '睡',
        '展', '跳', '获', '艺', '六', '波', '察', '群', '皇', '段', '急', '庭', '创', '区', '奥', '器', '谢', '弟', '店', '否',
        '害', '草', '排', '背', '止', '组', '州', '朝', '封', '睛', '板', '角', '况', '曲', '馆', '育', '忙', '质', '河', '续',
        '哥', '呼', '若', '推', '境', '遇', '雨', '标', '姐', '充', '围', '案', '伦', '护', '冷', '警', '贝', '著', '雪', '索',
        '剧', '啊', '船', '险', '烟', '依', '斗', '值', '帮', '汉', '慢', '佛', '肯', '闻', '唱', '沙', '局', '伯', '族', '低',
        '玩', '资', '屋', '击', '速', '顾', '泪', '洲', '团', '圣', '旁', '堂', '兵', '七', '露', '园', '牛', '哭', '旅', '街',
        '劳', '型', '烈', '姑', '陈', '莫', '鱼', '异', '抱', '宝', '权', '鲁', '简', '态', '级', '票', '怪', '寻', '杀', '律',
        '胜', '份', '汽', '右', '洋', '范', '床', '舞', '秘', '午', '登', '楼', '贵', '吸', '责', '例', '追', '较', '职', '属',
        '渐', '左', '录', '丝', '牙', '党', '继', '托', '赶', '章', '智', '冲', '叶', '胡', '吉', '卖', '坚', '喝', '肉', '遗',
        '救', '修', '松', '临', '藏', '担', '戏', '善', '卫', '药', '悲', '敢', '靠', '伊', '村', '戴', '词', '森', '耳', '差',
        '短', '祖', '云', '规', '窗', '散', '迷', '油', '旧', '适', '乡', '架', '恩', '投', '弹', '铁', '博', '雷', '府', '压',
        '超', '负', '勒', '杂', '醒', '洗', '采', '毫', '嘴', '毕', '九', '冰', '既', '状', '乱', '景', '席', '珍', '童', '顶',
        '派', '素', '脱', '农', '疑', '练', '野', '按', '犯', '拍', '征', '坏', '骨', '余', '承', '置', '臓', '彩', '灯', '巨',
        '琴', '免', '环', '姆', '暗', '换', '技', '翻', '束', '增', '忍', '餐', '洛', '塞', '缺', '忆', '判', '欧', '层', '付',
        '阵', '玛', '批', '岛', '项', '狗', '休', '懂', '武', '革', '良', '恶', '恋', '委', '拥', '娜', '妙', '探', '呀', '营',
        '退', '摇', '弄', '桌', '熟', '诺', '宣', '银', '势', '奖', '宫', '忽', '套', '康', '供', '优', '课', '鸟', '喊', '降',
        '夏', '困', '刘', '罪', '亡', '鞋', '健', '模', '败', '伴', '守', '挥', '鲜', '财', '孤', '枪', '禁', '恐', '伙', '杰',
        '迹', '妹', '藸', '遍', '盖', '副', '坦', '牌', '江', '顺', '秋', '萨', '菜', '划', '授', '归', '浪', '听', '凡', '预',
        '奶', '雄', '升', '碃', '编', '典', '袋', '莱', '含', '盛', '济', '蒙', '棋', '端', '腿', '招', '释', '介', '烧', '误',
        '乾', '坤', '二', '翔']
    n_length = random.randint(1,3)
    name = ''
    name += random.choice(last_name)
    for i in range(n_length):
        name += random.choice(first_name)
    return name

def random_name_s(n_type=1):
    try:
        n_type = int(n_type)  # 1:另一个名字,2:关系名称,3:名人
    except:
        n_type = 1
    name = ''
    if n_type == 1:
        n_type = random.choice([1,3])
    if n_type == 2:
        name += random.choice(['他', '她'])
        r = [
            '同桌', '班主任', '体育老师', '语文老师', '数学老师', '生物老师', '校长', '家邻居', '偶遇的野狗', '偶遇的野猫', '的同事', '的老板', '公司楼下卖煎饼的大叔', '在V2上认识的老哥', '在V2上认识的老姐', '在V2上认识的老弟', '在V2上认识的老妹', '沙雕小学生'
            ]
        name += random.choice(r)
    elif n_type == 3:
        c = [
            '马云', '马化腾', '王思聪', '赵四', '刘能', '谢广坤', '马里奥', 'JOJO', '机器猫', 'Nico', '谢大脚', '马大帅', '马里奥', '蜘蛛侠', '奥巴马', '特朗普', '乔布斯', '李三光', '如花', '八两金', '郭森斯坦达', '冯小肛', '孙笑川', 'EDC', '桥本环奈', '广末凉子', '新垣结衣', 'Lady Gaga', '罗志祥', 'M-zone人', 'cxk', '哈利波特', '伏地魔', '巫妖王', 'Uzi', '大湿的学徒', 'RH', '汉尼拔', '吴亦凡', '诸葛孔明'
        ]
        name = random.choice(c)
    else:
        name = random_name()
    return name

def random_site():
    site = [
        '体育场', '办公楼', '百货大楼', '电视塔', '人民广场', '海滨浴场', '小学', '中学', '大学', '电影院', '图书馆', '博物馆', '和平饭店', '酒店', '洗浴中心', '驾校', '火车站', '飞机场', '公园', '自己家', '老板家'
    ]
    return random.choice(site)

def random_site_area():
    area = [
        '男厕所', '女厕所', '下水道', '电梯', '通风井', '停车场', '餐厅', '宿舍', '教室', '更衣室', '游泳池', '淋浴间'
    ]
    return random.choice(area)

def random_adv():
    adv = [
        '开心', '兴奋', '愤怒', '失望', '悲伤', '无奈', '百无聊赖', '两眼放光', '浑身大汗', '忘我', '不知所措', '异常猥琐', '热泪盈眶', '欣然', '贸然', '悄悄', '火急火燎', '肆意', '表情严肃', '鼻青脸肿', '光明磊落'
    ]
    return random.choice(adv)

def random_action():
    action = [
        '吃', '打', '看', '玩', '卖', '买', '偷', '抢', '送', '研究', '拍摄', '画', '写'
    ]
    a = random.choice(action)
    base = [
        '扑克', '书', '手纸', '火车', '汽车', '飞机', '老婆', '小姨子', '老公', '小叔子', '键盘', '手机', '显示器', '防盗门', '阿迪王', '灭火器', '主播', '翔', '男士内裤', '女士内裤'
    ]
    chi = [
        '饭', '小龙虾', '铜锣烧', '切糕', '手手', '脚脚', '瓜', '火锅', '炒饭'
    ]
    da = [
        '扑克', '飞机', '老婆', '小姨子', '老公', '小叔子', '电话', '显示器', '防盗门', '灭火器', '主播', '翔', '太极', '架'
    ]
    kan = [
        '书', '手纸', '火车', '汽车', '飞机', '老婆', '小姨子', '老公', '小叔子', '键盘', '手机', '显示器', '主播', '翔', '电影', '报纸', '动物世界', '新闻联播', '逐梦演艺圈'
    ]
    wan = [
        '成语接龙', '摔跤', '光屁股赛跑'
    ]
    mai = [

    ]
    tou = [
        '塔', '人头'
    ]
    qiang = [
        '塔', '人头',
    ]
    song = [
        '塔', '人头', '温暖'
    ]
    yanjiu = [
        '爹', '怎么变身', '元首', 'cxk', '如何暴富', '如何欠钱不还', '广场舞', '成语接龙', '摔跤', '光屁股赛跑', '灭霸', '膜法', '人工智障', '倒立唱RAP', '二人转', '跳街舞', '成为司机'
    ]
    paishe = [
        '动物世界', '新闻联播', '逐梦演艺圈', '大碗宽面'
    ]
    hua = [
        '', '', '', '', '', '', ''
    ]
    xie = [
        '', '', '', '', '', '', ''
    ]

    if a == '吃':
        incident = random.choice(base + chi)
    elif a == '打':
        incident = random.choice(da)
    elif a == '看':
        incident = random.choice(kan)
    elif a in ['玩', '卖', '买', '偷', '抢', '送', '画', '写']:
        if a == '偷':
            incident = random.choice(base + tou)
        elif a == '抢':
            incident = random.choice(base + qiang)
        elif a == '送':
            incident = random.choice(base + song)
        elif a == '玩':
            incident = random.choice(base + wan)
        else:
            incident = random.choice(base)
    elif a == '研究':
        incident = random.choice(base + yanjiu)
    elif a == '拍摄':
        incident = random.choice(base + paishe)
    else:
        incident = random.choice(base)
    return a + incident

def random_sentence(type=1, n_type=1, name=None):
    # type:
    # 1. A 和 B 在 C 的 D 里 E 地 F（完整）
    # 2. A 在 C 里 F（最简）
    # 3. A 和 B 在 C 里 F (1/3)
    # 4. A 在 C 的 D 里 F (1/3)
    # 5. A 在 C 里 E 地 F (1/3)
    # 6. A 和 B 在 C 的 D 里 F (2/3)
    # 7. A 和 B 在 C 里 E 地 F (2/3)
    # 8. A 在 C 的 D 里 E 地 F (2/3)

    # A: 名字（随机） random_name()
    # B: 名字或者关系人物（可选，随机） random_name_second()
    # C: 地点（随机） random_site()
    # D: 地点下属区域（可选，随机） random_site_area()
    # E: 副词，修饰F（可选，随机） random_adv()
    # F: 动作（随机） random_action()

    # n_type = 1: c + c或相关
    # n_type = 2: 随机名字 + 随机名字
    # 如果有指定则name_1为指定

    try:
        n_type = int(n_type)
    except:
        n_type = 1
    if n_type == 1:
        name_1 = random_name_s(n_type=3)
        n_type_2 = random.choice([2,3])
        name_2 = random_name_s(n_type=n_type_2)
        while name_1 == name_2:
            name_2 = random_name_s(n_type=n_type_2)
    else:
        name_1 = random_name_s()
        name_2 = random_name_s()
        while name_1 == name_2:
            name_2 = random_name_s()

    if name is not None:
        try:
            name_1 = str(name)
        except:
            pass

    site = random_site()
    action = random_action()
    area = random_site_area()
    adv = random_adv()
    s = ''
    try:
        type = int(type)
    except:
        return 'TYPE ERROR'
    if type < 1 or type > 8:
        return 'TYPE ERROR'
    if type == 1:
        s += name_1
        s += ' 和 '
        s += name_2
        s += ' 在 '
        s += site
        s += ' 的 '
        s += area
        s += ' 里 '
        s += adv
        s += ' 地 '
        s += action
    elif type == 2:
        s += name_1
        s += ' 在 '
        s += site
        s += ' 里 '
        s += action
    elif type == 3:
        s += name_1
        s += ' 和 '
        s += name_2
        s += ' 在 '
        s += site
        s += ' 里 '
        s += action
    elif type == 4:
        s += name_1
        s += ' 在 '
        s += site
        s += ' 的 '
        s += area
        s += ' 里 '
        s += action
    elif type == 5:
        s += name_1
        s += ' 在 '
        s += site
        s += ' 里 '
        s += adv
        s += ' 地 '
        s += action
    elif type == 6:
        s += name_1
        s += ' 和 '
        s += name_2
        s += ' 在 '
        s += site
        s += ' 的 '
        s += area
        s += ' 里 '
        s += action
    elif type == 7:
        s += name_1
        s += ' 和 '
        s += name_2
        s += ' 在 '
        s += site
        s += ' 里 '
        s += adv
        s += ' 地 '
        s += action
    elif type == 8:
        s += name_1
        s += ' 在 '
        s += site
        s += ' 的 '
        s += area
        s += ' 里 '
        s += adv
        s += ' 地 '
        s += action
    else:
        return 'ERROR'
    return s
